<template>
  <div class="container-fluid pre-form">
    <h5 style="font-weight: bold">
      เปิดบัญชีกองทุนรวมแบบไม่เปิดเผยชื่อผู้ถือหน่วยลงทุน (Omnibus Account)
    </h5>
    <p>
      สามารถซื้อขายกองทุนรวมได้ทุกประเภท
      <u style="font-weight: bold">ยกเว้นกองทุนรวมแบบลดหย่อนภาษี</u>
      โดยจะทำการอนุมัติเปิดบัญชีกองทุนภายใน 1 วันทำการ
      และสามารถซื้อขายกองทุนได้ในวันทำการถัดไปหลังจากได้รับการอนุมัติ
    </p>
    <h6>
      เงื่อนไขการเปิดบัญชีกองทุนรวมแบบเปิดตรงกับหลักทรัพย์บัวหลวง
      ผ่านช่องทางออนไลน์
    </h6>
    <ol>
      <li :class="{ invalid: !isThaiPeople }">
        เป็นบุคคลธรรมดา สัญชาติไทยเท่านั้น
        <i
          class="glyphicon glyphicon-remove"
          aria-hidden="true"
          v-if="!isThaiPeople"
        ></i>
        <span v-if="!isThaiPeople">
          (ท่านมีสัญชาติ
          {{ displayValues.nationality | nationalityText | blankText("n/a") }})
        </span>
      </li>
      <li :class="{ invalid: !validateAge }">
        อายุครบ 20 ปี บริบูรณ์
        <i
          class="glyphicon glyphicon-remove"
          aria-hidden="true"
          v-if="!validateAge"
        ></i>
        <span v-if="!validateAge">
          (อายุของท่านในระบบ {{ this.displayValues.age }} ปี
        </span>
      </li>
      <li>
        จะต้องอ่านและยอมรับข้อตกลงและเงื่อนไขการใช้เว็บไซต์ของบริษัทหลักทรัพย์
        บัวหลวง จำกัด (มหาชน)
      </li>
    </ol>

    <div class="consent-block">
      <p>
        <strong>ข้อตกลงและเงื่อนไข</strong>
        <br />ข้อมูลทั้งหมดที่ปรากฏอยู่บนเว็บไซต์นี้ เป็นข้อมูลของ
        บริษัทหลักทรัพย์ บัวหลวง จำกัด (มหาชน) (ซึ่งต่อไปจะเรียกว่า “บริษัท”)
        เมื่อท่านเข้าชมและใช้บริการส่วนใดของเว็บไซต์นี้
        ถือว่าท่านได้ยอมรับข้อตกลงและเงื่อนไขการใช้ที่กำหนดดังต่อไปนี้
      </p>

      <p>
        <strong>ข้อจำกัดความรับผิด</strong>
        <br />ข้อมูลทั้งหมดที่บริษัทได้จัดทำขึ้นเพื่อนำเสนอต่อผู้ใช้บริการตามรายละเอียดที่ปรากฏอยู่บนเว็บไซต์นี้
        เป็นข้อมูลที่บริษัทได้พยายามจัดหามาด้วยความระมัดระวัง
        จากแหล่งข้อมูลต่างๆ ซึ่งเป็นที่ยอมรับกันโดยทั่วไปว่ามีความน่าเชื่อถือ
        แต่ทั้งนี้มิได้หมายความว่าบริษัทได้รับรองโดยชัดแจ้งหรือโดยปริยายว่าข้อมูลที่ปรากฏอยู่บนเว็บไซต์ทั้งหมดดังกล่าวนี้มีความถูกต้องสมบูรณ์และน่าเชื่อถือแต่อย่างใด
        อีกทั้งบริษัทจะไม่ขอรับผิดชอบในการชดใช้ค่าเสียหายใดๆ
        ที่เกิดขึ้นเนื่องมาจากการที่ผู้ใช้บริการได้ใช้ข้อมูลของบริษัทในเว็บไซต์นี้
      </p>

      <p>
        เนื้อหาทั้งหมดที่แสดงบนเว็บไซต์นี้ถูกนำเสนอตามสภาพที่ได้รับ (“as is”
        basis) บริษัทจึงไม่มีข้อรับประกันไม่ว่าในเรื่องใดๆ
        และโปรดทราบว่าบรรดาบทวิเคราะห์ คำแนะนำ หรือความคิดเห็นใดๆ
        ที่แสดงบนเว็บไซต์นี้ เป็นบทวิเคราะห์ คำแนะนำ
        หรือความคิดเห็นของผู้นำเสนอเนื้อหาดังกล่าวเท่านั้น
        การที่เนื้อหานั้นปรากฏบนเว็บไซต์นี้
        มิได้เป็นการแสดงว่าบริษัทเห็นพ้องหรือยอมรับบทวิเคราะห์
        คำแนะนำหรือความคิดเห็นนั้น
        เว้นแต่จะมีข้อความที่แสดงไว้ชัดแจ้งเป็นอย่างอื่น
      </p>

      <p>
        ข้อมูลที่ปรากฏบนเว็บไซต์นี้ไม่ถือเป็นการเสนอหรือจูงใจโดยบริษัทให้ทำการซื้อหรือขายหลักทรัพย์ใดๆ
        หรือตราสารทางการเงินอื่นๆ
        หรือเป็นการให้คำแนะนำเกี่ยวกับการลงทุนแต่อย่างใด
        บริษัทไม่ต้องรับผิดชอบต่อความเสียหายที่เกิดจากการตัดสินใจลงทุนซึ่งใช้ข้อมูลที่ปรากฏบนเว็บไซต์นี้เป็นพื้นฐาน
        ท่านจึงต้องเป็นผู้รับความเสี่ยงภัยด้วยตนเองหากมีการกระทำหรือตัดสินใจใดๆ
        โดยอาศัยเนื้อหาจากเว็บไซต์นี้
        บริษัทและพนักงานของบริษัทไม่รับผิดชอบต่อท่านหรือบุคคลใดๆ
        ในความเสียหายที่เกิดขึ้น ไม่ว่าโดยทางตรงหรือทางอ้อม
        จากการใช้เนื้อหาบนเว็บไซต์นี้ไม่ว่าด้วยเหตุใดๆ ซึ่งรวมถึง
        การที่เนื้อหานั้นไม่ถูกต้อง ผิดพลาด ไม่ครบถ้วน ไม่เป็นไปตามเวลา
        ไม่สมบูรณ์ ถูกลบ ถูกแก้ไข มีข้อบกพร่อง ไม่สามารถแสดงผล
        มีไวรัสคอมพิวเตอร์ หรือความขัดข้องของระบบสื่อสาร
      </p>

      <p>
        <strong>สิทธิในการเข้าถึง</strong>
        <br />บริษัทสงวนสิทธิในการปรับปรุงหรือแก้ไขเว็บไซต์หรือเนื้อหาใดๆ
        บนเว็บไซต์นี้ในเวลาใดๆ นอกจากนี้
        บริษัทสงวนสิทธิที่จะปฏิเสธหรือจำกัดการเข้าถึงเว็บไซต์นี้ของบุคคลใด
        หรือจากเลขที่อยู่อินเทอร์เน็ตใด
        โดยไม่จำเป็นต้องบอกกล่าวหรือระบุเหตุผลในการดำเนินการนั้น
      </p>

      <p>
        <strong>สิทธิในทรัพย์สินทางปัญญา</strong>
        <br />บริษัทเป็นเจ้าของโดยถูกต้องและสมบูรณ์ตามกฎหมายแต่เพียงผู้เดียวในเว็บไซต์นี้ทั้งหมด
        และหมายรวมถึงเป็นเจ้าของลิขสิทธิ์และสิทธิในฐานข้อมูลทั้งหมดในเว็บไซต์นี้
        และห้ามมิให้บุคคลใดกระทำการละเมิดโดยการลอกเลียน การทำซ้ำ
        จำหน่ายจ่ายแจกหรือนำไปตีพิมพ์ และ/หรือทำการโฆษณาด้วยวิธีการใดๆ
        ไม่ว่าจะเป็นการทำเพื่อวัตถุประสงค์ใดๆ ก็ตาม
        เว้นแต่จะได้รับอนุญาตเป็นลายลักษณ์อักษรจากบริษัทเสียก่อน
        หากผู้ใดทำการละเมิดลิขสิทธิ์ในความเป็นเจ้าของ และสิทธิใดๆ
        ที่ได้รับความคุ้มครองตามกฎหมายทรัพย์สินทางปัญญาของบริษัทดังกล่าวข้างต้น
        บริษัทมีสิทธิที่จะทำการเรียกร้องค่าเสียหายใดๆ
        ที่เกิดขึ้นจากการกระทำของบุคคลดังกล่าวได้
      </p>

      <p>
        <strong>การเชื่อมโยงไปยังเว็บไซต์ของบุคคลที่สาม</strong>
        <br />การเชื่อมโยงเว็บไซต์นี้กับเว็บไซต์ของบุคคลที่สามเป็นเพียงการอำนวยความสะดวกให้แก่ท่านเท่านั้น
        บริษัทมิได้มีส่วนเกี่ยวข้อง ไม่ว่าในลักษณะใดๆ
        กับเว็บไซต์ของบุคคลที่สามเหล่านั้น และบริษัทไม่รับผิดชอบต่อเนื้อหาใดๆ
        ที่แสดงบนเว็บไซต์เหล่านั้น หรือต่อความเสียหายใดๆ
        ที่เกิดขึ้นจากการเข้าชมเว็บไซต์เหล่านั้น
      </p>

      <p>
        <strong>กฎหมายที่ใช้บังคับ</strong>
        <br />ข้อตกลงและเงื่อนไขการใช้ฉบับนี้อยู่ภายใต้บังคับแห่งกฎหมายไทย
      </p>
    </div>

    <p>
      หรือสอบถามข้อมูลเพิ่มเติมได้ที่ผู้แนะนำการลงุทนของท่าน หรือ BLS Customer
      Service โทร. 0-2618-1111 Email :
      <a href="mailto:customerservice@bualuang.co.th"
        >customerservice@bualuang.co.th</a
      >
    </p>
    <div class="text-center" style="margin-top: 40px">
      <button
        type="button"
        class="btn btn-primary"
        style="white-space: normal"
        :disabled="isDisabledStartButton"
        @click.prevent="onClickStart"
      >
        ยอมรับและเปิดบัญชีกองทุนรวม คลิกที่นี่
      </button>
    </div>
  </div>
</template>

<script>
import { defaultDisplayValues } from "../../services/constants";

import { nationalityText } from "../../services/filters";

export default {
  name: "OmnibusPreForm",
  data() {
    return {
      isOpenCRS: false,
      crsData:'',
    };
  },

  props: {
    displayValues: {
      type: Object,
      default() {
        return defaultDisplayValues;
      },
    },

    values: {
      type: Object,
      required: true,
    },
    crsState: {
      type: Number,
      required: false
    }
  },

  computed: {
    isThaiPeople() {
      return this.displayValues.nationality === "000";
    },

    validateAge() {
      return this.displayValues.age >= 20;
    },

    isDisabledStartButton() {
      return !this.isThaiPeople || !this.validateAge;
    },
  },

  methods: {
    onClickStart() {
      //  if (
      //   typeof window.openCRSWithCallback === "function" &&
      //   this.crsState == 1
      // ) {
      //   window.openCRSWithCallback(this.handleResult);
      // } else {
       
      //   this.$emit("started");
      // }
      this.$emit("started");
    },
     handleResult(result) {
      if (typeof result === "object" && result !== null) {
        this.crsData = result;
        this.$emit("crsData" , this.crsData);
      } else if (result === true) {
        this.$emit("started");
      }
    }
  },

  filters: {
    nationalityText,
  },
};
</script>

<style>
.bls-fund-application .pre-form li.invalid {
  color: #ff0000;
  font-weight: 600;
}

.bls-fund-application .pre-form li.invalid .glyphicon {
  color: #ff0000;
}

.bls-fund-application .pre-form .consent-block {
  padding: 10px;
  height: 200px;
  overflow-y: scroll;
  border: 1px solid #ddd;
  margin: 15px 0;
}

@media screen and (min-width: 768px) {
  .bls-fund-application .pre-form {
    font-size: 14px;
  }
}
</style>